{
  "skyblockStatus": [
    "Housing Browser Unavailable | Resolved - This incident has been resolved. | Dec 10, 18:59 EST",
    "Housing Browser Unavailable | Monitoring - We have now implemented a fix to improve guild lookup during house browsing, and we have re-enabled the full functionality of the browser and are monitoring. | Dec 10, 16:26 EST",
    "Housing Browser Unavailable | Update - We have identified an issue causing the Housing browser to fail loading houses. In the meantime, we have disabled the browser looking up Guild information. | Dec 10, 14:03 EST",
    "Housing Browser Unavailable | Identified - We have identified an issue causing the Housing browser to fail loading houses. In the meantime, we have disabled the browser looking up Guild information. | Dec 10, 13:09 EST",
    "Housing Browser Unavailable | Investigating - We are currently investigating an issue with the Housing browser being unavailable | Dec 10, 13:01 EST",
    "Forums and Reward Claiming Unavailable | Resolved - This incident has been resolved. | Dec  8, 21:39 EST",
    "Forums and Reward Claiming Unavailable | Monitoring - A fix has been implemented and we are monitoring the results. | Dec  8, 21:32 EST",
    "Forums and Reward Claiming Unavailable | Investigating - We are currently investigating an issue with the Hypixel Forums and Daily Rewards claiming to be unavailable | Dec  8, 20:57 EST",
    "Emergency Maintenance | Resolved - This incident has been resolved. | Nov 16, 14:40 EST",
    "Emergency Maintenance | Monitoring - A fix has been implemented and we are monitoring as we re-open the server | Nov 16, 14:21 EST",
    "Emergency Maintenance | Update - We are continuing to investigate issues with one of our core services and as a result, we are in emergency maintenance. Players will be unable to join and the Public API is unavailable. | Nov 16, 14:04 EST",
    "Emergency Maintenance | Investigating - We are currently investigating issues with one of our core services and as a result, we are in emergency maintenance. | Nov 16, 13:56 EST",
    "1.14+ Join Issues | Resolved - This incident has been resolved. | Oct 14, 23:54 EDT",
    "1.14+ Join Issues | Monitoring - A fix has been implemented and we are monitoring the results. | Oct 14, 23:32 EDT",
    "1.14+ Join Issues | Identified - We have identified the cause that is blocking players in 1.14 and later to join the server and we are rolling out a fix as quickly as possible. | Oct 14, 23:00 EDT",
    "1.14+ Join Issues | Investigating - We are currently investigating an issue where players in 1.14 and later may be unable to join the server | Oct 14, 22:56 EDT",
    "SkyBlock Emergency Maintenance | Resolved - The Bazaar and Auction House have both been enabled and we are continuing to monitor for any further issues. | Oct 10, 15:10 EDT",
    "SkyBlock Emergency Maintenance | Monitoring - We are now slowly opening the game back to players. The Bazaar and Auction House will remain closed and we will provide further updates tomorrow. | Oct  9, 18:23 EDT",
    "SkyBlock Emergency Maintenance | Update - Due to the ongoing exploit, we have chosen to close the game for emergency maintenance. We will provide updates as necessary. | Oct  9, 14:30 EDT",
    "SkyBlock Emergency Maintenance | Investigating - We are investigating further exploits similar to the incident earlier today, as a result, some features are disabled. | Oct  9, 14:06 EDT",
    "SkyBlock Features Disabled | Resolved - This incident has been resolved. | Oct  9, 11:31 EDT",
    "SkyBlock Features Disabled | Monitoring - A fix has been implemented and we are slowly re-enabling disabled features across the game. | Oct  9, 09:29 EDT",
    "SkyBlock Features Disabled | Investigating - We are currently investigating an exploit within SkyBlock and as a result, some features are currently disabled. | Oct  9, 07:49 EDT",
    "High latency for Europe connections | Resolved - This incident has been resolved. | Oct  3, 19:05 EDT",
    "High latency for Europe connections | Monitoring - Our upstream provider has implemented a fix and we are monitoring. | Oct  3, 17:23 EDT",
    "High latency for Europe connections | Investigating - We are currently investigating an issue with our upstream provider resulting in higher latency for players in Europe. | Oct  3, 13:00 EDT",
    "SkyBlock Profile Management Disabled | Resolved - This incident has been resolved. | Sep 11, 12:46 EDT",
    "SkyBlock Profile Management Disabled | Monitoring - A fix has been implemented and we are monitoring the results. | Sep 11, 06:33 EDT",
    "SkyBlock Profile Management Disabled | Investigating - SkyBlock Profile Management has been disabled as we investigate potential issues. | Sep 10, 13:02 EDT",
    "SkyBlock Bazaar Disabled | Resolved - This incident has been resolved. | Sep 11, 12:46 EDT",
    "SkyBlock Bazaar Disabled | Update - We are continuing to monitor for any further issues. | Sep 11, 06:34 EDT",
    "SkyBlock Bazaar Disabled | Monitoring - The SkyBlock Bazaar has been disabled temporarily whilst we perform some backend changes. | Sep 10, 02:41 EDT",
    "Parties unavailable | Resolved - This incident has been resolved. | Sep 10, 13:28 EDT",
    "Parties unavailable | Monitoring - A fix has been implemented and we are monitoring the results. | Sep 10, 13:20 EDT",
    "Parties unavailable | Investigating - We are currently investigating issues with party commands failing and other issues related to the parties service. | Sep 10, 13:18 EDT",
    "SkyBlock Hex Disabled | Resolved - This incident has been resolved. | Sep  7, 19:48 EDT",
    "SkyBlock Hex Disabled | Monitoring - A fix has been implemented, the hex is now re-enabled and we are monitoring the results. | Sep  7, 12:46 EDT",
    "SkyBlock Hex Disabled | Identified - An issue has been identified with the Hex and a fix is being implemented. | Sep  6, 05:50 EDT",
    "SkyBlock Bazaar Disabled | Resolved - This incident has been resolved. | Sep  5, 14:28 EDT",
    "SkyBlock Bazaar Disabled | Monitoring - A fix has been implemented and we are monitoring the results. | Sep  4, 20:00 EDT",
    "SkyBlock Bazaar Disabled | Identified - The Bazaar is currently disabled due to exploits, we have identified the issue and are working to resolve it. | Sep  4, 16:57 EDT",
    "SkyBlock Dungeons Disabled | Resolved - This incident has been resolved. | Sep  1, 11:41 EDT",
    "SkyBlock Dungeons Disabled | Update - We are continuing to work on bringing dungeons back online and have added additional potential fixes to the Alpha Network. | Aug 29, 14:05 EDT",
    "SkyBlock Dungeons Disabled | Identified - We have identified the potential issue and have opened the Alpha Network for further testing and monitoring. | Aug 26, 14:12 EDT",
    "SkyBlock Dungeons Disabled | Investigating - SkyBlock Dungeons are currently disabled while we are investigating a number of reported issues within the Dungeons system. | Aug 25, 14:36 EDT",
    "SkyBlock Bazaar Disabled | Resolved - This incident has been resolved. | Aug 23, 19:12 EDT",
    "SkyBlock Bazaar Disabled | Monitoring - A fix has been implemented and we are monitoring the results. | Aug 23, 14:48 EDT",
    "SkyBlock Bazaar Disabled | Identified - We have identified an issue with the SkyBlock Bazaar and have disabled it to prevent any further issues from occurring. | Aug 23, 07:06 EDT",
    "SkyBlock Dungeons Disabled | Resolved - Dungeons are now back to normal operation and the previously mentioned issues have been resolved. | Aug 23, 12:12 EDT",
    "SkyBlock Dungeons Disabled | Update - The player cap has been removed from Dungeons and we will continue to monitor for any further issues. | Aug 23, 09:22 EDT",
    "SkyBlock Dungeons Disabled | Monitoring - Fixes have been implemented and we are monitoring the results on live with a lower player cap on Dungeons. | Aug 23, 06:54 EDT",
    "SkyBlock Dungeons Disabled | Identified - Some issue have been identified and fixes are being implemented on the Alpha Network. | Aug 21, 18:56 EDT",
    "SkyBlock Dungeons Disabled | Update - We are continuing to investigate the reported Dungeon issues and have released a public statement regarding our next actions: https://hypixel.net/threads/dungeons-temporarily-unavailable.5082869/ | Aug 21, 14:00 EDT",
    "SkyBlock Dungeons Disabled | Investigating - SkyBlock Dungeons are currently disabled while we are investigating a number of reported issues within the Dungeons system. | Aug 21, 13:38 EDT",
    "PublicAPI Increased Response Times | Resolved - This incident has been resolved. | Aug 21, 15:34 EDT",
    "PublicAPI Increased Response Times | Monitoring - We have made some changes to improve the response times back to their normal levels and are monitoring. | Aug 21, 15:12 EDT",
    "PublicAPI Increased Response Times | Investigating - We are currently investigating an issue with increased response times on the PublicAPI. Some endpoints may be disabled while we investigate. | Aug 21, 15:00 EDT",
    "SkyBlock Maintenance | Completed - The scheduled maintenance has been completed. | Aug 19, 12:24 EDT",
    "SkyBlock Maintenance | In progress - Scheduled maintenance is currently in progress and being monitored. We will provide updates as necessary. | Aug 18, 20:22 EDT",
    "SkyBlock Maintenance | Scheduled - Scheduled maintenance is currently in progress and being monitored. We will provide updates as necessary. | Aug 18, 20:21 EDT",
    "SkyBlock Maintenance | Completed - The scheduled maintenance has been completed. | Aug 18, 20:01 EDT",
    "SkyBlock Maintenance | In progress - Scheduled maintenance is currently in progress. We will provide updates as necessary. | Aug 18, 10:02 EDT",
    "SkyBlock Maintenance | Scheduled - SkyBlock will be going under maintenance in 30 minutes to release update 0.14. During this time, SkyBlock will be unavailable. | Aug 18, 09:33 EDT",
    "Minecraft Server Outage | Resolved - This incident has been resolved. | Aug  6, 13:01 EDT",
    "Minecraft Server Outage | Monitoring - We have implemented a fix and are now monitoring | Aug  6, 12:40 EDT",
    "Minecraft Server Outage | Investigating - We are currently investigating an outage with the Hypixel Minecraft Server | Aug  6, 12:37 EDT",
    "Outage | Resolved - This incident has been resolved. | Aug  4, 23:22 EDT",
    "Outage | Monitoring - Our upstream provider have implemented a fix and we are monitoring | Aug  4, 22:59 EDT",
    "Outage | Update - Our upstream provider are continuing to work on implementing a fix for this issue. | Aug  4, 22:07 EDT",
    "Outage | Identified - The issue causing a major outage has been found to be caused by an upstream provider. We will provide updates as necessary. | Aug  4, 20:42 EDT",
    "Outage | Investigating - We are currently investigating an outage across the server, forums, and Public API. | Aug  4, 20:27 EDT",
    "SkyBlock Auction House Maintenance | Completed - The scheduled maintenance has been completed. | Jul 28, 11:26 EDT",
    "SkyBlock Auction House Maintenance | Verifying - The Auction House is now enabled again, we are monitoring the results of the maintenance | Jul 28, 10:56 EDT",
    "SkyBlock Auction House Maintenance | In progress - The SkyBlock Auction House is currently undergoing maintenance for updates to the backend service. During this time the auction house will be unavailable, the Bazaar may also be unavailable for periods during this time. Auctions active during maintenance will have their duration extended for the duration of the maintenance. | Jul 28, 10:00 EDT",
    "SkyBlock Auction House Maintenance | Scheduled - The SkyBlock Auction House will be undergoing maintenance for updates to the backend service. During this time the auction house will be unavailable, the Bazaar may also be unavailable for periods during this time. Auctions active during maintenance will have their duration extended for the duration of the maintenance. | Jul 26, 18:42 EDT",
    "Proxies failing to balance | Resolved - This incident has been resolved. | Jul 13, 13:22 EDT",
    "Proxies failing to balance | Monitoring - A fix has been implemented and we are monitoring the results. | Jul 13, 13:14 EDT",
    "Proxies failing to balance | Investigating - We are currently investigating an issue of our proxies failing to balance. We have reduced the maximum player count of the server during this issue. | Jul 13, 12:52 EDT",
    "SkyBlock Auction House, Bazaar, and Bank Disabled | Resolved - This incident has been resolved. | Jul  9, 09:46 EDT",
    "SkyBlock Auction House, Bazaar, and Bank Disabled | Monitoring - A fix has been implemented and we are monitoring the results. Everything has been re-enabled and auction timers have been extended due to the down time. | Jul  9, 04:19 EDT",
    "SkyBlock Auction House, Bazaar, and Bank Disabled | Identified - The issue has been identified and a fix is being implemented. | Jul  9, 03:26 EDT",
    "SkyBlock Auction House, Bazaar, and Bank Disabled | Investigating - The Auction House, Bazaar, and Bank are currently disabled due to exploits, we are currently investigating the issues. | Jul  9, 00:51 EDT",
    "SkyBlock Auction House & Bazaar Disabled | Resolved - This incident has been resolved. | Jun  9, 17:53 EDT",
    "SkyBlock Auction House & Bazaar Disabled | Monitoring - A fix has been implemented and we are monitoring the results. | Jun  8, 15:53 EDT",
    "SkyBlock Auction House & Bazaar Disabled | Identified - The Auction House and Bazaar are currently disabled due to exploits, the issues have been identified and fixes are being implemented. | Jun  6, 12:43 EDT",
    "Players unable to connect | Resolved - This incident has been resolved. | Jun  3, 15:17 EDT",
    "Players unable to connect | Monitoring - A fix has been implemented and we are monitoring the results. | Jun  3, 14:39 EDT",
    "Players unable to connect | Identified - The issue has been identified and a fix is being implemented. | Jun  3, 12:21 EDT",
    "Minecraft Server and Public API Unavailable | Monitoring - A fix has been implemented and we are slowly re-opening the server to players. | Feb  6, 18:58 EST",
    "Minecraft Server and Public API Unavailable | Investigating - We are currently investigating a major issue with our backend systems causing the Minecraft Server and Public API to be unavailable. | Feb  6, 17:41 EST",
    "SkyBlock Profiles API | Resolved - We have made some backend changes with the aim to improve the recent issues of increased response times on the SkyBlock profiles API and it is now operating normally. We will be monitoring the results over the coming days and will made additional changes if needed. | Feb  4, 17:49 EST",
    "SkyBlock Profiles API | Investigating - We are investigating issues with the SkyBlock Profiles endpoints on the Hypixel Public API. During this time the endpoint may be disabled while we attempt to investigate and work on a solution. | Feb  4, 14:32 EST",
    "SkyBlock Update 0.18 | In progress - SkyBlock is currently undergoing maintenance for the release of 0.18. | Feb 14, 09:56 EST",
    "SkyBlock Update 0.18 | Scheduled - SkyBlock will be undergoing maintenance for the release of 0.18. | Feb 14, 09:51 EST",
    "Minecraft Server and Public API Unavailable | Resolved - This incident has been resolved. | Feb  6, 22:10 EST",
    "Hypixel Store Maintenance | Completed - The scheduled maintenance has been completed. | Mar 14, 04:31 EDT",
    "Hypixel Store Maintenance | In progress - Scheduled maintenance is currently in progress. We will provide updates as necessary. | Mar 14, 03:31 EDT",
    "Hypixel Store Maintenance | Scheduled - The Hypixel Store (store.hypixel.net) will be undergoing routine maintenance at the specified time for about 1 hour. The in-game store is unaffected. | Mar 13, 12:40 EDT",
    "SkyBlock Update 0.18 | Completed - The scheduled maintenance has been completed. | Feb 14, 12:18 EST",
    "Hypixel Forums Maintenance | Completed - The scheduled maintenance has been completed. | Apr 13, 09:05 EDT",
    "Hypixel Forums Maintenance | In progress - Scheduled maintenance is currently in progress. We will provide updates as necessary. | Apr 13, 08:51 EDT",
    "Hypixel Forums Maintenance | Scheduled - We will be undergoing routine maintenance during the specified duration. | Apr 13, 08:51 EDT",
    "Hypixel Forums Unavailable | Resolved - This incident has been resolved. | Apr 12, 16:08 EDT",
    "Hypixel Forums Unavailable | Investigating - We are currently investigating an issue with the Hypixel Forums being offline and unavailable | Apr 12, 16:01 EDT",
    "SkyBlock Profiles Maintenance | May  5, 15:23 EDT | THIS IS A SCHEDULED EVENT May 9, 05:00 - 17:00 EDT",
    "SkyBlock Profiles API disabled | Resolved - This incident has been resolved. | Apr 29, 15:04 EDT",
    "SkyBlock Profiles API disabled | Monitoring - We have re-enabled the SkyBlock profiles endpoints and are monitoring. | Apr 29, 12:13 EDT",
    "SkyBlock Profiles API disabled | Investigating - We are currently investigating issues with the SkyBlock profiles API and as a result, we have disabled the profile endpoints. We do not currently have an ETA for when they will be enabled. | Apr 29, 10:31 EDT",
    "SkyBlock Profiles Maintenance | Resolved - SkyBlock is now open to all players. We are not aware of any issues after the profile changes, if you come across any bugs please report them https://hypixel.net/bug-reports/create | May 16, 19:31 EDT",
    "SkyBlock Profiles Maintenance | Monitoring - SkyBlock is still undergoing maintenance for profile structure changes and migration and we are monitoring the results. | May 16, 17:03 EDT",
    "SkyBlock Profiles Maintenance | Completed - The scheduled maintenance has been completed. | May 16, 17:00 EDT",
    "SkyBlock Profiles Maintenance | Update - We have now re-enabled some features, such as the Dark Auction and Museum. We have also enabled the SkyBlock profile endpoints, these endpoints will only return data for players who have logged in and migrated to the new profile system. | May 16, 16:26 EDT",
    "SkyBlock Profiles Maintenance | Verifying - We are now allowing some players into SkyBlock as we further monitor the migration of profiles to the new system. Some features are disabled during this time, and the SkyBlock Profiles API is still currently unavailable. | May 16, 15:36 EDT",
    "SkyBlock Profiles Maintenance | In progress - We are currently investigating issues related to players who have been invited or kicked from a coop since the migration, and as a result we have disabled joining SkyBlock. | May 16, 13:30 EDT",
    "SkyBlock Profiles Maintenance | Verifying - We are now starting to allow some players into SkyBlock as we monitor the migration of profiles to the new system. Some features are disabled during this time, and the SkyBlock Profiles API is still currently unavailable. | May 16, 11:44 EDT",
    "SkyBlock Profiles Maintenance | In progress - Scheduled maintenance is currently in progress. We will provide updates as necessary. | May 16, 05:00 EDT",
    "SkyBlock Profiles Maintenance | Update - Due to unforeseen issues, we are delaying this maintenance to next week to allow further validation of the changes. | May  8, 17:11 EDT",
    "SkyBlock Profiles Maintenance | Scheduled - SkyBlock will be undergoing maintenance to migrate profile data to a new system. During this time SkyBlock and related Public API endpoints will be unavailable. We are estimating this maintenance to take up to 12 hours, assuming no unforeseen issues occur. | May  5, 15:23 EDT",
    "Increased Public API response times for SkyBlock profiles | Resolved - This incident has been resolved. | May 13, 12:14 EDT",
    "Increased Public API response times for SkyBlock profiles | Monitoring - A fix has been implemented and we are monitoring the results. | May 13, 11:02 EDT",
    "Increased Public API response times for SkyBlock profiles | Investigating - We are currently investigating an issue causing increased response times for SkyBlock profile requests on the Public API. | May 13, 09:53 EDT",
    "SkyBlock Bazaar and Booster Cookies disabled | Update - We have re-opened the Bazaar and enabled consuming Booster Cookies. Any players affected by the issue of cookies purchased that could not be consumed should have had them refunded as a delivery in Jerry. | Jul 12, 12:55 EDT",
    "SkyBlock Bazaar and Booster Cookies disabled | Monitoring - We have re-opened the Bazaar and enabled consuming Booster Cookies. Any players affected by the issue of cookies purchased that could not be consumed should have them refunded as soon as possible. | Jul 12, 12:31 EDT",
    "SkyBlock Bazaar and Booster Cookies disabled | Investigating - We are currently investigating an issue with booster cookies and the bazaar, and as a result, both of these systems are currently disabled. | Jul 12, 10:41 EDT",
    "SMP Maintenance | In progress - Scheduled maintenance is currently in progress. We will provide updates as necessary. | Jul 11, 08:00 EDT",
    "SMP Maintenance | Scheduled - SMP will be undergoing maintenance and will be unavailable. We aim to complete maintenance as soon as possible but we cannot guarantee an ETA. | Jul 10, 10:53 EDT",
    "SkyBlock Rift Unavailable | Resolved - This incident has been resolved. | Jul  2, 15:34 EDT",
    "SkyBlock Rift Unavailable | Monitoring - A fix has been implemented and we are monitoring the results. | Jun 26, 21:38 EDT",
    "SkyBlock Rift Unavailable | Identified - We have identified issues regarding recent changes within the Rift island and as a result have temporarily disabled access to the Rift island while we work on a solution. | Jun 26, 08:01 EDT",
    "Players unable to join due to authentication | Resolved - This incident has been resolved. | Jun 27, 12:39 EDT",
    "Players unable to join due to authentication | Monitoring - A fix has been implemented and we are monitoring the results. | Jun 27, 12:32 EDT",
    "Players unable to join due to authentication | Investigating - We are currently investigating an issue with an upstream provider causing player authentication to fail and resulting in some players being unable to join. | Jun 27, 12:28 EDT",
    "SkyBlock Update 0.19 | Completed - The scheduled maintenance has been completed. | Jun 20, 14:54 EDT",
    "SkyBlock Update 0.19 | In progress - Scheduled maintenance is currently in progress. We will provide updates as necessary. | Jun 20, 08:00 EDT",
    "SkyBlock Update 0.19 | Scheduled - SkyBlock will be undergoing maintenance for the release of 0.19. | Jun 19, 12:19 EDT",
    "Players unable to join due to authentication | Resolved - This incident has been resolved. | Jun  1, 19:28 EDT",
    "Players unable to join due to authentication | Investigating - We are currently investigating an issue with an upstream provider causing player authentication to fail and resulting in some players being unable to join. | Jun  1, 19:19 EDT",
    "Players unable to connect | Resolved - This incident has been resolved. | May 29, 16:36 EDT",
    "Players unable to connect | Monitoring - A fix has been implemented and we are monitoring the results. | May 29, 14:30 EDT",
    "Players unable to connect | Investigating - We are currently aware and investigating an issue that is causing players to be unable to join the Hypixel Server. | May 29, 13:28 EDT",
    "SkyBlock Bazaar and Booster Cookies disabled | Resolved - This incident has been resolved. | Jul 12, 14:04 EDT"
  ],
  "skyblockUpdates": [
    "[February 22] SkyBlock Patch Notes | https://hypixel.net/threads/february-22-skyblock-patch-notes.5276871/",
    "[February 16] Final Dungeon Journals | https://hypixel.net/threads/february-16-final-dungeon-journals.5276354/",
    "[February 3] Autopet Changes | https://hypixel.net/threads/february-3-autopet-changes.5262861/",
    "[February 2] Patch 0.17.3 Bug Fixes | https://hypixel.net/threads/february-2-patch-0-17-3-bug-fixes.5261361/",
    "[February 6] SkyBlock Patch Notes | https://hypixel.net/threads/february-6-skyblock-patch-notes.5266045/",
    "[January 10th] Some Bug Fixes | https://hypixel.net/threads/january-10th-some-bug-fixes.5233523/",
    "[January 5th] Knockback Resistance changes | https://hypixel.net/threads/january-5th-knockback-resistance-changes.5227516/",
    "[December 13] SkyBlock Patch Notes | https://hypixel.net/threads/december-13-skyblock-patch-notes.5199900/",
    "[December 14] Winter Follow Up | https://hypixel.net/threads/december-14-winter-follow-up.5200757/",
    "[November 23] SkyBlock Patch Notes | https://hypixel.net/threads/november-23-skyblock-patch-notes.5178848/",
    "[November 30] SkyBlock Patch Notes | https://hypixel.net/threads/november-30-skyblock-patch-notes.5185776/",
    "[December 8] SkyBlock Kuudra Infernal Follow-up Patch Notes 1 | https://hypixel.net/threads/december-8-skyblock-kuudra-infernal-follow-up-patch-notes-1.5193363/",
    "[August 27] Maddox is Mad | https://hypixel.net/threads/august-27-maddox-is-mad.5091190/",
    "[November 15] SkyBlock Patch Notes | https://hypixel.net/threads/november-15-skyblock-patch-notes.5171788/",
    "[November 21] SkyBlock Patch Notes | https://hypixel.net/threads/november-21-skyblock-patch-notes.5177240/",
    "[July 3] Random Damage Hotfix | https://hypixel.net/threads/july-3-random-damage-hotfix.3081457/",
    "[September 8] Test Of Control - SkyBlock Dojo Challenge | https://hypixel.net/threads/september-8-test-of-control-skyblock-dojo-challenge.5104568/",
    "[0.9.13] Catacombs Floor 7 | https://hypixel.net/threads/0-9-13-catacombs-floor-7.3543616/",
    "[September 15] Temporary Minion Simulation Patch | https://hypixel.net/threads/september-15-temporary-minion-simulation-patch.5112401/",
    "[September 6] Moby's Fishing Speed Chumpdate | https://hypixel.net/threads/september-6-mobys-fishing-speed-chumpdate.5103151/",
    "SkyBlock Patch 0.18 - The Garden | https://hypixel.net/threads/skyblock-patch-0-18-the-garden.5273460/",
    "Wool Wars 1.2 Update - Bug Fixes, Animated Cages, Settings & more. | https://hypixel.net/threads/wool-wars-1-2-update-bug-fixes-animated-cages-settings-more.5179749/",
    "Hypixel now supports Minecraft 1.16 | https://hypixel.net/threads/hypixel-now-supports-minecraft-1-16.3039094/",
    "Hypixel Tournaments - Blitz Duo | https://hypixel.net/threads/hypixel-tournaments-blitz-duo.1909057/",
    "Hypixel now supports Minecraft 1.19 | https://hypixel.net/threads/hypixel-now-supports-minecraft-1-19.4976618/",
    "SkyBlock Patch 0.17.2 - Leveling Part 2 | https://hypixel.net/threads/skyblock-patch-0-17-2-leveling-part-2.5233602/",
    "In Case You Missed It #3 | https://hypixel.net/threads/in-case-you-missed-it-3.5253493/",
    "Happy Holidays from Hypixel! | https://hypixel.net/threads/happy-holidays-from-hypixel.5184912/",
    "SkyBlock Patch 0.17.3 - Guide Menu & SkyBlock Menu Updates | https://hypixel.net/threads/skyblock-patch-0-17-3-guide-menu-skyblock-menu-updates.5259963/",
    "Dev Blog #11: Optimizing Reports with Machine Learning | https://hypixel.net/threads/dev-blog-11-optimizing-reports-with-machine-learning.5065246/",
    "Murder Mystery Patch - January 2023 | https://hypixel.net/threads/murder-mystery-patch-january-2023.5158450/",
    "Happy Lunar New Year and Year of the Rabbit! | https://hypixel.net/threads/happy-lunar-new-year-and-year-of-the-rabbit.5242668/",
    "SkyBlock 0.17.1 - Kuudra Infernal Tier, Party Finder and more! | https://hypixel.net/threads/skyblock-0-17-1-kuudra-infernal-tier-party-finder-and-more.5193181/",
    "Translation Update - Danish! | https://hypixel.net/threads/translation-update-danish.5208257/",
    "10 Years of the Hypixel Forums | https://hypixel.net/threads/10-years-of-the-hypixel-forums.5117456/",
    "SkyBlock Patch 0.15 - Leveling, Balancing, and more! | https://hypixel.net/threads/skyblock-patch-0-15-leveling-balancing-and-more.5123436/",
    "Bed Wars Map Update - 8 New Maps | https://hypixel.net/threads/bed-wars-map-update-8-new-maps.5159414/",
    "Alpha Net - A new way to test SkyBlock Updates | https://hypixel.net/threads/alpha-net-a-new-way-to-test-skyblock-updates.4326510/",
    "2022 Roundup - Generate your unique stats on Hypixel | https://hypixel.net/threads/2022-roundup-generate-your-unique-stats-on-hypixel.5206859/",
    "Translation Update - Swedish and Romanian! | https://hypixel.net/threads/translation-update-swedish-and-romanian.5143286/",
    "[February 28] SkyBlock Patch Notes | https://hypixel.net/threads/february-28-skyblock-patch-notes.5290534/",
    "Housing Update - Housing+, New Placeholders, and more! | https://hypixel.net/threads/housing-update-housing-new-placeholders-and-more.5271605/",
    "Hypixel Tournaments - Blitz Duo 3rd Iteration | https://hypixel.net/threads/hypixel-tournaments-blitz-duo-3rd-iteration.5304290/",
    "Bug Fixes - March 2023 | https://hypixel.net/threads/bug-fixes-march-2023.5285394/",
    "Upcoming Blitz Survival Games kit changes | https://hypixel.net/threads/upcoming-blitz-survival-games-kit-changes.104241/",
    "Easter Event on Hypixel | https://hypixel.net/threads/easter-event-on-hypixel.4903080/",
    "Player Account Status - Know Where You Stand | https://hypixel.net/threads/player-account-status-know-where-you-stand.4376642/",
    "[March 21] SkyBlock Patch Notes | https://hypixel.net/threads/march-21-skyblock-patch-notes.5311515/",
    "SkyBlock Patch 0.18.1 - Achievements & Bug Fixes | https://hypixel.net/threads/skyblock-patch-0-18-1-achievements-bug-fixes.5298274/",
    "Bed Wars Update - Item Rotation and Bug Fixes | https://hypixel.net/threads/bed-wars-update-item-rotation-and-bug-fixes.5180486/",
    "Hypixel 10th Anniversary Celebration & Easter Event! | https://hypixel.net/threads/hypixel-10th-anniversary-celebration-easter-event.5320131/",
    "SkyWars Update - New Prestiges, QoL changes, Balancing and Bug Fixes - March 2023 | https://hypixel.net/threads/skywars-update-new-prestiges-qol-changes-balancing-and-bug-fixes-march-2023.5303364/",
    "Translation Update - Hungarian! | https://hypixel.net/threads/translation-update-hungarian.5311273/",
    "Introducing the Hypixel Battle Pass + Statuses! | https://hypixel.net/threads/introducing-the-hypixel-battle-pass-statuses.2010087/",
    "Blitz Duo 3rd Iteration Tournament Results! | https://hypixel.net/threads/blitz-duo-3rd-iteration-tournament-results.5318905/",
    "SkyBlock Update 0.18.2 - Garden and Stranded Update | https://hypixel.net/threads/skyblock-update-0-18-2-garden-and-stranded-update.5317809/",
    "[March 24] Various Grammatical Fixes | https://hypixel.net/threads/march-24-various-grammatical-fixes.5314082/",
    "10 Year Anniversary Contests - Results + Surprise Gift! | https://hypixel.net/threads/10-year-anniversary-contests-results-surprise-gift.5333726/",
    "SkyBlock Patch 0.18.3 - Garden Crop Growth & Presets, Bazaar & Sack Additions, Bug Fixes, & More | https://hypixel.net/threads/skyblock-patch-0-18-3-garden-crop-growth-presets-bazaar-sack-additions-bug-fixes-more.5324136/",
    "UHC Modifiers, Achievements & Bug fixes | https://hypixel.net/threads/uhc-modifiers-achievements-bug-fixes.4035874/",
    "Bed Wars Update - New Practice Modes, QoL Changes & More! | https://hypixel.net/threads/bed-wars-update-new-practice-modes-qol-changes-more.5339873/",
    "Balancing, Replay Support, Pregame Parkours and Bug Fixes - Mega Walls Patch April 2023 | https://hypixel.net/threads/balancing-replay-support-pregame-parkours-and-bug-fixes-mega-walls-patch-april-2023.5318734/",
    "Achievement Update | New Rewards, Balancing, and More! | https://hypixel.net/threads/achievement-update-new-rewards-balancing-and-more.1866948/",
    "SkyBlock Patch 0.18.4 - Sack Additions & Bug Fixes | https://hypixel.net/threads/skyblock-patch-0-18-4-sack-additions-bug-fixes.5360095/",
    "SkyBlock Patch 0.19.1 - Item Linking, Leveling Update, Stash QoL, & Bug Fixes | https://hypixel.net/threads/skyblock-patch-0-19-1-item-linking-leveling-update-stash-qol-bug-fixes.5422629/",
    "Login Alerts - Argus | https://hypixel.net/threads/login-alerts-argus.3284306/",
    "Hypixel now supports Minecraft 1.20 | https://hypixel.net/threads/hypixel-now-supports-minecraft-1-20.5386736/",
    "2023 Summer Event and Sale! | https://hypixel.net/threads/2023-summer-event-and-sale.5408071/",
    "SkyBlock Patch 0.19 - The Rift | https://hypixel.net/threads/skyblock-patch-0-19-the-rift.5399251/",
    "SkyBlock - 4th Anniversary! | https://hypixel.net/threads/skyblock-4th-anniversary.5387715/",
    "SkyBlock Patch 0.18.5 - Abiphone Contacts, Dungeons Balancing, & Bug Fixes | https://hypixel.net/threads/skyblock-patch-0-18-5-abiphone-contacts-dungeons-balancing-bug-fixes.5380870/",
    "Atlas - Community Based Replay Review System | https://hypixel.net/threads/atlas-community-based-replay-review-system.3630110/",
    "[June 29] SkyBlock Patch Notes | https://hypixel.net/threads/june-29-skyblock-patch-notes.5410140/",
    "[June 26] SkyBlock Patch Notes | https://hypixel.net/threads/june-26-skyblock-patch-notes.5406480/",
    "[June 23] Rift Day 3 Patch | https://hypixel.net/threads/june-23-rift-day-3-patch.5404126/",
    "[June 26] Rift Shen's Changes | https://hypixel.net/threads/june-26-rift-shens-changes.5406362/",
    "Resolution to Rift Access (6/26/23) | https://hypixel.net/threads/resolution-to-rift-access-6-26-23.5407127/",
    "[June 14] SkyBlock Patch Notes | https://hypixel.net/threads/june-14-skyblock-patch-notes.5393862/",
    "[June 7] SkyBlock Patch Notes | https://hypixel.net/threads/june-7-skyblock-patch-notes.5385735/",
    "[June 21] Undead Patch | https://hypixel.net/threads/june-21-undead-patch.5401355/",
    "[May 26] Repair Wizard Portal City Project | https://hypixel.net/threads/may-26-repair-wizard-portal-city-project.5376262/"
  ]
}
